# Module 1 - Reshaping Data with Pandas
## Pandas Part 3

In [1]:
import pandas as pd
uci = pd.read_csv('data/heart.csv')

## 3. Methods for Re-Organizing DataFrames
#### `.groupby()`

Those of you familiar with SQL have probably used the GROUP BY command. Pandas has this, too.

The `.groupby()` method is especially useful for aggregate functions applied to the data grouped in particular ways.

In [2]:
uci.groupby('sex')

#### `.groups` and `.get_group()`

In [3]:
uci.groupby('sex').groups

{0: Int64Index([  2,   4,   6,  11,  14,  15,  16,  17,  19,  25,  28,  30,  35,
              36,  38,  39,  40,  43,  48,  49,  50,  53,  54,  59,  60,  65,
              67,  69,  74,  75,  82,  84,  85,  88,  89,  93,  94,  96, 102,
             105, 107, 108, 109, 110, 112, 115, 118, 119, 120, 122, 123, 124,
             125, 127, 128, 129, 130, 131, 134, 135, 136, 140, 142, 143, 144,
             146, 147, 151, 153, 154, 155, 161, 167, 181, 182, 190, 204, 207,
             213, 215, 216, 220, 223, 241, 246, 252, 258, 260, 263, 266, 278,
             289, 292, 296, 298, 302],
            dtype='int64'),
 1: Int64Index([  0,   1,   3,   5,   7,   8,   9,  10,  12,  13,
             ...
             288, 290, 291, 293, 294, 295, 297, 299, 300, 301],
            dtype='int64', length=207)}

In [4]:
uci.groupby('sex').get_group(0)

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
6,56,0,1,140,294,0,0,153,0,1.3,1,0,2,1
11,48,0,2,130,275,0,1,139,0,0.2,2,0,2,1
14,58,0,3,150,283,1,0,162,0,1.0,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
289,55,0,0,128,205,0,2,130,1,2.0,1,1,3,0
292,58,0,0,170,225,1,0,146,1,2.8,1,2,1,0
296,63,0,0,124,197,0,1,136,1,0.0,1,0,2,0
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

### Aggregating

In [ ]:
uci.groupby('sex').mean()

Exercise: Tell me the average cholesterol level for those with heart disease.

In [6]:
# Your code here!
uci.groupby('target').mean()

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal
target,,,,,,,,,,,,,
0,56.601449,0.826087,0.478261,134.398551,251.086957,0.159420,0.449275,139.101449,0.550725,1.585507,1.166667,1.166667,2.543478
1,52.496970,0.563636,1.375758,129.303030,242.230303,0.139394,0.593939,158.466667,0.139394,0.583030,1.593939,0.363636,2.121212

In [9]:
uci.groupby('target').get_group(1).mean()

age          52.496970
sex           0.563636
cp            1.375758
trestbps    129.303030
chol        242.230303
fbs           0.139394
restecg       0.593939
thalach     158.466667
exang         0.139394
oldpeak       0.583030
slope         1.593939
ca            0.363636
thal          2.121212
target        1.000000
dtype: float64

In [10]:
uci.groupby('sex').min()

,age,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
sex,,,,,,,,,,,,,
0,34,0,94,141,0,0,96,0,0.0,0,0,0,0
1,29,0,94,126,0,0,71,0,0.0,0,0,0,0

In [11]:
uci.groupby(['sex', 'cp']).min()

        age  trestbps  chol  fbs  restecg  thalach  exang  oldpeak  slope  ca  \
sex cp
0   0    35       100   149    0        0      106      0      0.0      0   0
    1    34       105   160    0        0      121      0      0.0      1   0
    2    37        94   141    0        0       96      0      0.0      0   0
    3    58       140   226    0        0      114      0      0.9      0   0
1   0    35       100   131    0        0       71      0      0.0      0   0
    1    29       101   157    0        0      103      0      0.0      0   0
    2    37        94   126    0        0      112      0      0.0      0   0
    3    34       110   182    0        0      125      0      0.0      0   0

        thal  target
sex cp
0   0      1       0
    1      2       0
    2      0       0
    3      2       1
1   0      0       0
    1      1       0
    2      1       0
    3      1       0

### Apply to Animal Shelter Data

In [12]:
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD')

#### Task 1
- Use a groupby to show the average age of the different kinds of animal types.
- What about by animal types **and** gender?

In [14]:
import datetime
animal_outcomes['DateTime'] = pd.to_datetime(animal_outcomes.DateTime)
animal_outcomes['MonthYear'] = pd.to_datetime(animal_outcomes.MonthYear)

In [ ]:
animal_outcomes['age'] = pd.to_datetime(animal_outcomes.DateTime).map(
    lambda x: round((datetime.datetime.now() - x).days / 365, 2))

In [6]:
import datetime
animal_outcomes['age'] = pd.to_datetime(animal_outcomes.DateTime).map(
    lambda x: round((datetime.datetime.now() - x).days / 365,2))

#### Task 2:
- Create new columns `year` and `month` by using a lambda function x.year on date
- Use `groupby` and `.size()` to tell me how many animals are adopted by month

In [ ]:
# Your code here

## 4. Reshaping a DataFrame

### `.pivot()`

Those of you familiar with Excel have probably used Pivot Tables. Pandas has a similar functionality.

In [ ]:
uci.pivot(values='sex', columns='target').head()

### Methods for Combining DataFrames: `.join()`, `.merge()`, `.concat()`, `.melt()`

### `.join()`

In [ ]:
toy1 = pd.DataFrame([[63, 142], [33, 47]], columns=['age', 'HP'])
toy2 = pd.DataFrame([[63, 100], [33, 200]], columns=['age', 'HP'])

In [ ]:
toy1.join(toy2.set_index('age'),
          on='age',
          lsuffix='_A',
          rsuffix='_B').head()

### `.merge()`

In [ ]:
ds_chars = pd.read_csv('data/ds_chars.csv', index_col=0)

In [ ]:
states = pd.read_csv('data/states.csv', index_col=0)

In [ ]:
ds_chars.merge(states,
               left_on='home_state',
               right_on='state',
               how='inner')

### `pd.concat()`

In [ ]:
pd.concat([ds_chars, states], sort=False)

### `pd.melt()`

Melting removes the structure from your DataFrame and puts the data in a 'variable' and 'value' format.

In [ ]:
ds_chars.head()

In [ ]:
pd.melt(ds_chars,
        id_vars=['name'],
        value_vars=['HP', 'home_state'])

## Bringing it all together with the Animal Shelter Data

Join the data from the [Austin Animal Shelter Intake dataset](https://data.austintexas.gov/Health-and-Community-Services/Austin-Animal-Center-Intakes/wter-evkm) to the outcomes dataset by Animal ID.

Use the dates from each dataset to see how long animals spend in the shelter. Does it differ by time of year? By outcome?

_Hints_ :
- import and clean the intake dataset first
- use `apply`/`applymap`/`lambda` to change the variables to their proper format in the intake data
- rename the columns in the intake dataset *before* joining
- create a new `days-in-shelter` column
- Notice that some values in `days_in_shelter` are `NaN` or values < 0 (remove these rows using the "<" operator and `isna()` or `dropna()`)
- Use `groupby` to get aggregate information about the dataset (your choice)

To save your dataset:
Use the notation `df.to_csv()` or `df.to_excel()` to write the `df` to a csv. Read more about the `to_csv()` documentation [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.to_csv.html)

In [8]:
animal_intakes = pd.read_csv('https://data.austintexas.gov/api/views/wter-evkm/rows.csv?accessType=DOWNLOAD')
animal_outcomes = pd.read_csv('https://data.austintexas.gov/api/views/9t4d-g238/rows.csv?accessType=DOWNLOAD')

In [10]:
animal_intakes.head(2)

,Animal ID,Name,DateTime,MonthYear,Found Location,Intake Type,Intake Condition,Animal Type,Sex upon Intake,Age upon Intake,Breed,Color
0,A786884,*Brock,01/03/2019 04:19:00 PM,01/03/2019 04:19:00 PM,2501 Magin Meadow Dr in Austin (TX),Stray,Normal,Dog,Neutered Male,2 years,Beagle Mix,Tricolor
1,A706918,Belle,07/05/2015 12:59:00 PM,07/05/2015 12:59:00 PM,9409 Bluegrass Dr in Austin (TX),Stray,Normal,Dog,Spayed Female,8 years,English Springer Spaniel,White/Liver

In [16]:
animal_intakes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117743 entries, 0 to 117742
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Animal ID         117743 non-null  object
 1   Name              80681 non-null   object
 2   DateTime          117743 non-null  datetime64[ns]
 3   MonthYear         117743 non-null  object
 4   Found Location    117743 non-null  object
 5   Intake Type       117743 non-null  object
 6   Intake Condition  117743 non-null  object
 7   Animal Type       117743 non-null  object
 8   Sex upon Intake   117742 non-null  object
 9   Age upon Intake   117743 non-null  object
 10  Breed             117743 non-null  object
 11  Color             117743 non-null  object
dtypes: datetime64[ns](1), object(11)
memory usage: 10.8+ MB

In [11]:
animal_outcomes.head(2)

,Animal ID,Name,DateTime,MonthYear,Date of Birth,Outcome Type,Outcome Subtype,Animal Type,Sex upon Outcome,Age upon Outcome,Breed,Color
0,A794011,Chunk,05/08/2019 06:20:00 PM,05/08/2019 06:20:00 PM,05/02/2017,Rto-Adopt,NaN,Cat,Neutered Male,2 years,Domestic Shorthair Mix,Brown Tabby/White
1,A776359,Gizmo,07/18/2018 04:02:00 PM,07/18/2018 04:02:00 PM,07/12/2017,Adoption,NaN,Dog,Neutered Male,1 year,Chihuahua Shorthair Mix,White/Brown

In [15]:
animal_outcomes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 118036 entries, 0 to 118035
Data columns (total 12 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Animal ID         118036 non-null  object
 1   Name              81056 non-null   object
 2   DateTime          118036 non-null  datetime64[ns]
 3   MonthYear         118036 non-null  object
 4   Date of Birth     118036 non-null  object
 5   Outcome Type      118028 non-null  object
 6   Outcome Subtype   53658 non-null   object
 7   Animal Type       118036 non-null  object
 8   Sex upon Outcome  118032 non-null  object
 9   Age upon Outcome  117989 non-null  object
 10  Breed             118036 non-null  object
 11  Color             118036 non-null  object
dtypes: datetime64[ns](1), object(11)
memory usage: 10.8+ MB

In [14]:
#changing DateTime into date format
import datetime
animal_intakes['DateTime'] = pd.to_datetime(animal_intakes.DateTime)
animal_outcomes['DateTime'] = pd.to_datetime(animal_outcomes.DateTime)

In [21]:
# joining both datasets
animal_database = animal_intakes.join(animal_outcomes.set_index('Animal ID'),
          on='Animal ID',
          lsuffix='_intakes',
          rsuffix='_outcomes')
animal_database.head(3)

,Animal ID,Name_intakes,DateTime_intakes,MonthYear_intakes,Found Location,Intake Type,Intake Condition,Animal Type_intakes,Sex upon Intake,Age upon Intake,...,DateTime_outcomes,MonthYear_outcomes,Date of Birth,Outcome Type,Outcome Subtype,Animal Type_outcomes,Sex upon Outcome,Age upon Outcome,Breed_outcomes,Color_outcomes
0,A786884,*Brock,2019-01-03 16:19:00,01/03/2019 04:19:00 PM,2501 Magin Meadow Dr in Austin (TX),Stray,Normal,Dog,Neutered Male,2 years,...,2019-01-08 15:11:00,01/08/2019 03:11:00 PM,01/03/2017,Transfer,Partner,Dog,Neutered Male,2 years,Beagle Mix,Tricolor
1,A706918,Belle,2015-07-05 12:59:00,07/05/2015 12:59:00 PM,9409 Bluegrass Dr in Austin (TX),Stray,Normal,Dog,Spayed Female,8 years,...,2015-07-05 15:13:00,07/05/2015 03:13:00 PM,07/05/2007,Return to Owner,NaN,Dog,Spayed Female,8 years,English Springer Spaniel,White/Liver
2,A724273,Runster,2016-04-14 18:43:00,04/14/2016 06:43:00 PM,2818 Palomino Trail in Austin (TX),Stray,Normal,Dog,Intact Male,11 months,...,2016-04-21 17:17:00,04/21/2016 05:17:00 PM,04/17/2015,Return to Owner,NaN,Dog,Neutered Male,1 year,Basenji Mix,Sable/White

In [38]:
animal_database['days_in_shelter'] = (animal_database.DateTime_outcomes - animal_database.DateTime_intakes).map(lambda x: x.days)

In [39]:
animal_database.head(3)

,Animal ID,Name_intakes,DateTime_intakes,MonthYear_intakes,Found Location,Intake Type,Intake Condition,Animal Type_intakes,Sex upon Intake,Age upon Intake,...,Date of Birth,Outcome Type,Outcome Subtype,Animal Type_outcomes,Sex upon Outcome,Age upon Outcome,Breed_outcomes,Color_outcomes,days in shelter,days_in_shelter
0,A786884,*Brock,2019-01-03 16:19:00,01/03/2019 04:19:00 PM,2501 Magin Meadow Dr in Austin (TX),Stray,Normal,Dog,Neutered Male,2 years,...,01/03/2017,Transfer,Partner,Dog,Neutered Male,2 years,Beagle Mix,Tricolor,4 days 22:52:00,4
1,A706918,Belle,2015-07-05 12:59:00,07/05/2015 12:59:00 PM,9409 Bluegrass Dr in Austin (TX),Stray,Normal,Dog,Spayed Female,8 years,...,07/05/2007,Return to Owner,NaN,Dog,Spayed Female,8 years,English Springer Spaniel,White/Liver,0 days 02:14:00,0
2,A724273,Runster,2016-04-14 18:43:00,04/14/2016 06:43:00 PM,2818 Palomino Trail in Austin (TX),Stray,Normal,Dog,Intact Male,11 months,...,04/17/2015,Return to Owner,NaN,Dog,Neutered Male,1 year,Basenji Mix,Sable/White,6 days 22:34:00,6

In [28]:
animal_database = animal_database.dropna(subset=['days_in_shelter'])

In [40]:
animal_database.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 152184 entries, 0 to 117740
Data columns (total 25 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Animal ID             152184 non-null  object
 1   Name_intakes          114477 non-null  object
 2   DateTime_intakes      152184 non-null  datetime64[ns]
 3   MonthYear_intakes     152184 non-null  object
 4   Found Location        152184 non-null  object
 5   Intake Type           152184 non-null  object
 6   Intake Condition      152184 non-null  object
 7   Animal Type_intakes   152184 non-null  object
 8   Sex upon Intake       152183 non-null  object
 9   Age upon Intake       152184 non-null  object
 10  Breed_intakes         152184 non-null  object
 11  Color_intakes         152184 non-null  object
 12  Name_outcomes         114477 non-null  object
 13  DateTime_outcomes     152184 non-null  datetime64[ns]
 14  MonthYear_outcomes    152184 non-null  object
 15  Date of Birth         152184 non-null  object
 16  Outcome Type          152176 non-null  object
 17  Outcome Subtype       58681 non-null   object
 18  Animal Type_outcomes  152184 non-null  object
 19  Sex upon Outcome      152179 non-null  object
 20  Age upon Outcome      152136 non-null  object
 21  Breed_outcomes        152184 non-null  object
 22  Color_outcomes        152184 non-null  object
 23  days in shelter       152184 non-null  timedelta64[ns]
 24  days_in_shelter       152184 non-null  int64
dtypes: datetime64[ns](2), int64(1), object(21), timedelta64[ns](1)
memory usage: 30.2+ MB

In [45]:
animal_database_1 = animal_database.drop(animal_database[animal_database.days_in_shelter
                                                         < 0].index)

In [46]:
animal_database.head(3)

,Animal ID,Name_intakes,DateTime_intakes,MonthYear_intakes,Found Location,Intake Type,Intake Condition,Animal Type_intakes,Sex upon Intake,Age upon Intake,...,Date of Birth,Outcome Type,Outcome Subtype,Animal Type_outcomes,Sex upon Outcome,Age upon Outcome,Breed_outcomes,Color_outcomes,days in shelter,days_in_shelter
0,A786884,*Brock,2019-01-03 16:19:00,01/03/2019 04:19:00 PM,2501 Magin Meadow Dr in Austin (TX),Stray,Normal,Dog,Neutered Male,2 years,...,01/03/2017,Transfer,Partner,Dog,Neutered Male,2 years,Beagle Mix,Tricolor,4 days 22:52:00,4
1,A706918,Belle,2015-07-05 12:59:00,07/05/2015 12:59:00 PM,9409 Bluegrass Dr in Austin (TX),Stray,Normal,Dog,Spayed Female,8 years,...,07/05/2007,Return to Owner,NaN,Dog,Spayed Female,8 years,English Springer Spaniel,White/Liver,0 days 02:14:00,0
2,A724273,Runster,2016-04-14 18:43:00,04/14/2016 06:43:00 PM,2818 Palomino Trail in Austin (TX),Stray,Normal,Dog,Intact Male,11 months,...,04/17/2015,Return to Owner,NaN,Dog,Neutered Male,1 year,Basenji Mix,Sable/White,6 days 22:34:00,6

In [48]:
animal_database_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 116555 entries, 0 to 117738
Data columns (total 25 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   Animal ID             116555 non-null  object
 1   Name_intakes          80018 non-null   object
 2   DateTime_intakes      116555 non-null  datetime64[ns]
 3   MonthYear_intakes     116555 non-null  object
 4   Found Location        116555 non-null  object
 5   Intake Type           116555 non-null  object
 6   Intake Condition      116555 non-null  object
 7   Animal Type_intakes   116555 non-null  object
 8   Sex upon Intake       116554 non-null  object
 9   Age upon Intake       116555 non-null  object
 10  Breed_intakes         116555 non-null  object
 11  Color_intakes         116555 non-null  object
 12  Name_outcomes         80018 non-null   object
 13  DateTime_outcomes     116555 non-null  datetime64[ns]
 14  MonthYear_outcomes    116555 non-null  object
 15  Date of Birth         116555 non-null  object
 16  Outcome Type          116548 non-null  object
 17  Outcome Subtype       52733 non-null   object
 18  Animal Type_outcomes  116555 non-null  object
 19  Sex upon Outcome      116551 non-null  object
 20  Age upon Outcome      116508 non-null  object
 21  Breed_outcomes        116555 non-null  object
 22  Color_outcomes        116555 non-null  object
 23  days in shelter       116555 non-null  timedelta64[ns]
 24  days_in_shelter       116555 non-null  int64
dtypes: datetime64[ns](2), int64(1), object(21), timedelta64[ns](1)
memory usage: 23.1+ MB

In [51]:
animal_database_1.groupby(['Animal Type_intakes', 'days_in_shelter']).count()
# print(animal_database_1)

                                     Animal ID  Name_intakes  \
Animal Type_intakes days_in_shelter
Bird                0                      167            16
                    1                       31            12
                    2                       21             4
                    3                       51             7
                    4                       32             6
...                                        ...           ...
Other               385                      1             0
                    424                      1             1
                    681                      1             0
                    797                      1             1
                    1191                     1             1

                                     DateTime_intakes  MonthYear_intakes  \
Animal Type_intakes days_in_shelter
Bird                0                             167                167
                    1                              31                 31
                    2                              21                 21
                    3                              51                 51
                    4                              32                 32
...                                               ...                ...
Other               385                             1                  1
                    424                             1                  1
                    681                             1                  1
                    797                             1                  1
                    1191                            1                  1

                                     Found Location  Intake Type  \
Animal Type_intakes days_in_shelter
Bird                0                           167          167
                    1                            31           31
                    2                            21           21
                    3                            51           51
                    4                            32           32
...                                             ...          ...
Other               385                           1            1
                    424                           1            1
                    681                           1            1
                    797                           1            1
                    1191                          1            1

                                     Intake Condition  Sex upon Intake  \
Animal Type_intakes days_in_shelter
Bird                0                             167              167
                    1                              31               31
                    2                              21               21
                    3                              51               51
                    4                              32               32
...                                               ...              ...
Other               385                             1                1
                    424                             1                1
                    681                             1                1
                    797                             1                1
                    1191                            1                1

                                     Age upon Intake  Breed_intakes  ...  \
Animal Type_intakes days_in_shelter                                  ...
Bird                0                            167            167  ...
                    1                             31             31  ...
                    2                             21             21  ...
                    3                             51             51  ...
                    4                             32             32  ...
...                                              ...            ...  ...
Other               385                            1              1  ...
                    424                            1              1  ...
                    681                            1              1  ...
                    797                            1              1  ...
                    1191                           1              1  ...

                                     MonthYear_outcomes  Date of Birth  \
Animal Type_intakes days_in_shelter
Bird                0                               167            167
                    1                                31             31
                    2                                21             21
                    3                                51             51
                    4                                32             32
...                                                 ...            ...
Other               385                               1              1
                    424                               1              1
                    681                               1              1
                    797                               1              1
                    1191                              1              1

                                     Outcome Type  Outcome Subtype  \
Animal Type_intakes days_in_shelter
Bird                0                         167              129
                    1                          31               18
                    2                          21               16
                    3                          51               24
                    4                          32               14
...                                           ...              ...
Other               385                         1                1
                    424                         1                1
                    681                         1                0
                    797                         1                0
                    1191                        1                0

                                     Animal Type_outcomes  Sex upon Outcome  \
Animal Type_intakes days_in_shelter
Bird                0                                 167               167
                    1                                  31                31
                    2                                  21                21
                    3                                  51                51
                    4                                  32                32
...                                                   ...               ...
Other               385                                 1                 1
                    424                                 1                 1
                    681                                 1                 1
                    797                                 1                 1
                    1191                                1                 1

                                     Age upon Outcome  Breed_outcomes  \
Animal Type_intakes days_in_shelter
Bird                0                             167             167
                    1                              31              31
                    2                              21              21
                    3                              51              51
                    4                              32              32
...                                               ...             ...
Other               385                             1               1
                    424                             1               1
                    681                             1               1
                    797                             1               1
                    1191                            1               1

                                     Color_outcomes  days in shelter
Animal Type_intakes days_in_shelter
Bird                0                           167              167
                    1                            31               31
                    2                            21               21
                    3                            51               51
                    4                            32               32
...                                             ...              ...
Other               385                           1                1
                    424                           1                1
                    681                           1                1
                    797                           1                1
                    1191                          1                1

[2437 rows x 23 columns]

In [54]:
#to convert to csv
animal_database_1.to_csv(r'C:\Users\Adebodun Aina\FlatIron\working_folder\hbs-ds-060120\module-1\day-7-pandas-3\animal_database_1.csv')

In [ ]:
#code here

## 5. Pandas Practice

### Introduction

In [93]:
# find and import the World Cup data held in data/ folder
w_cup = pd.read_csv('data/WorldCupMatches.csv')

In [71]:
w_cup.head(2)

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
0,1930,13 Jul 1930 - 15:00,Group 1,Pocitos,Montevideo,France,4,1,Mexico,,4444.0,3,0,LOMBARDI Domingo (URU),CRISTOPHE Henry (BEL),REGO Gilberto (BRA),201,1096,FRA,MEX
1,1930,13 Jul 1930 - 15:00,Group 4,Parque Central,Montevideo,USA,3,0,Belgium,,18346.0,2,0,MACIAS Jose (ARG),MATEUCCI Francisco (URU),WARNKEN Alberto (CHI),201,1090,USA,BEL

In [72]:
w_cup.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 852 entries, 0 to 851
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Year                  852 non-null    int64
 1   Datetime              852 non-null    object
 2   Stage                 852 non-null    object
 3   Stadium               852 non-null    object
 4   City                  852 non-null    object
 5   Home Team Name        852 non-null    object
 6   Home Team Goals       852 non-null    int64
 7   Away Team Goals       852 non-null    int64
 8   Away Team Name        852 non-null    object
 9   Win conditions        852 non-null    object
 10  Attendance            850 non-null    float64
 11  Half-time Home Goals  852 non-null    int64
 12  Half-time Away Goals  852 non-null    int64
 13  Referee               852 non-null    object
 14  Assistant 1           852 non-null    object
 15  Assistant 2           852 non-null    object
 16  RoundID               852 non-null    int64
 17  MatchID               852 non-null    int64
 18  Home Team Initials    852 non-null    object
 19  Away Team Initials    852 non-null    object
dtypes: float64(1), int64(7), object(12)
memory usage: 133.2+ KB

In [73]:
w_cup.describe()

,Year,Home Team Goals,Away Team Goals,Attendance,Half-time Home Goals,Half-time Away Goals,RoundID,MatchID
count,852.000000,852.000000,852.000000,850.000000,852.000000,852.000000,8.520000e+02,8.520000e+02
mean,1985.089202,1.811033,1.022300,45164.800000,0.708920,0.428404,1.066177e+07,6.134687e+07
std,22.448825,1.610255,1.087573,23485.249247,0.937414,0.691252,2.729613e+07,1.110572e+08
min,1930.000000,0.000000,0.000000,2000.000000,0.000000,0.000000,2.010000e+02,2.500000e+01
25%,1970.000000,1.000000,0.000000,30000.000000,0.000000,0.000000,2.620000e+02,1.188750e+03
50%,1990.000000,2.000000,1.000000,41579.500000,0.000000,0.000000,3.370000e+02,2.191000e+03
75%,2002.000000,3.000000,2.000000,61374.500000,1.000000,1.000000,2.497220e+05,4.395006e+07
max,2014.000000,10.000000,7.000000,173850.000000,6.000000,5.000000,9.741060e+07,3.001865e+08

### Practice Questions <a id="practice"></a>

1. Subset the DataFrame to only non-null rows.

In [94]:
#dropping na rows
w_cup1 = w_cup.dropna(subset = ['Attendance'])

In [75]:
w_cup1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 850 entries, 0 to 851
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Year                  850 non-null    int64
 1   Datetime              850 non-null    object
 2   Stage                 850 non-null    object
 3   Stadium               850 non-null    object
 4   City                  850 non-null    object
 5   Home Team Name        850 non-null    object
 6   Home Team Goals       850 non-null    int64
 7   Away Team Goals       850 non-null    int64
 8   Away Team Name        850 non-null    object
 9   Win conditions        850 non-null    object
 10  Attendance            850 non-null    float64
 11  Half-time Home Goals  850 non-null    int64
 12  Half-time Away Goals  850 non-null    int64
 13  Referee               850 non-null    object
 14  Assistant 1           850 non-null    object
 15  Assistant 2           850 non-null    object
 16  RoundID               850 non-null    int64
 17  MatchID               850 non-null    int64
 18  Home Team Initials    850 non-null    object
 19  Away Team Initials    850 non-null    object
dtypes: float64(1), int64(7), object(12)
memory usage: 139.5+ KB

2. How many of the matches were in Montevideo?

In [95]:
w_cup1 = w_cup1.copy()

In [96]:
w_cup1['City'] = w_cup1['City'].astype(str)
# data["Salary"]= data["Salary"].astype(int)

In [97]:
w_cup1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 850 entries, 0 to 851
Data columns (total 20 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Year                  850 non-null    int64
 1   Datetime              850 non-null    object
 2   Stage                 850 non-null    object
 3   Stadium               850 non-null    object
 4   City                  850 non-null    object
 5   Home Team Name        850 non-null    object
 6   Home Team Goals       850 non-null    int64
 7   Away Team Goals       850 non-null    int64
 8   Away Team Name        850 non-null    object
 9   Win conditions        850 non-null    object
 10  Attendance            850 non-null    float64
 11  Half-time Home Goals  850 non-null    int64
 12  Half-time Away Goals  850 non-null    int64
 13  Referee               850 non-null    object
 14  Assistant 1           850 non-null    object
 15  Assistant 2           850 non-null    object
 16  RoundID               850 non-null    int64
 17  MatchID               850 non-null    int64
 18  Home Team Initials    850 non-null    object
 19  Away Team Initials    850 non-null    object
dtypes: float64(1), int64(7), object(12)
memory usage: 139.5+ KB

In [85]:
w_cup1.City.value_counts().index

Index(['Mexico City ', 'Rio De Janeiro ', 'Montevideo ', 'Guadalajara ',
       'Johannesburg ', 'Sao Paulo ', 'Buenos Aires ', 'Leon ',
       'Belo Horizonte ', 'Munich ',
       ...
       'Strasbourg ', 'Lugano ', 'Reims ', 'Lille ', 'Orebro ', 'Udevalla ',
       'Trieste ', 'Le Havre ', 'Eskilstuna ', 'Antibes '],
      dtype='object', length=151)

In [82]:
w_cup1.head()

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
0,1930,13 Jul 1930 - 15:00,Group 1,Pocitos,Montevideo,France,4,1,Mexico,,4444.0,3,0,LOMBARDI Domingo (URU),CRISTOPHE Henry (BEL),REGO Gilberto (BRA),201,1096,FRA,MEX
1,1930,13 Jul 1930 - 15:00,Group 4,Parque Central,Montevideo,USA,3,0,Belgium,,18346.0,2,0,MACIAS Jose (ARG),MATEUCCI Francisco (URU),WARNKEN Alberto (CHI),201,1090,USA,BEL
2,1930,14 Jul 1930 - 12:45,Group 2,Parque Central,Montevideo,Yugoslavia,2,1,Brazil,,24059.0,2,0,TEJADA Anibal (URU),VALLARINO Ricardo (URU),BALWAY Thomas (FRA),201,1093,YUG,BRA
3,1930,14 Jul 1930 - 14:50,Group 3,Pocitos,Montevideo,Romania,3,1,Peru,,2549.0,1,0,WARNKEN Alberto (CHI),LANGENUS Jean (BEL),MATEUCCI Francisco (URU),201,1098,ROU,PER
4,1930,15 Jul 1930 - 16:00,Group 1,Parque Central,Montevideo,Argentina,1,0,France,,23409.0,0,0,REGO Gilberto (BRA),SAUCEDO Ulises (BOL),RADULESCU Constantin (ROU),201,1085,ARG,FRA

In [90]:
def strip_white_speace(val):
    if type(val) == str:
        return val.strip()
    else: return val

In [99]:
w_cup2 = w_cup1.applymap(strip_white_speace)

In [ ]:
w_cup2

In [102]:
#Your code here.
w_cup2.loc[w_cup2['City'] == 'Montevideo']
# print(len(w_cup1[w_cup1.City=="Montevideo"]))

,Year,Datetime,Stage,Stadium,City,Home Team Name,Home Team Goals,Away Team Goals,Away Team Name,Win conditions,Attendance,Half-time Home Goals,Half-time Away Goals,Referee,Assistant 1,Assistant 2,RoundID,MatchID,Home Team Initials,Away Team Initials
0,1930,13 Jul 1930 - 15:00,Group 1,Pocitos,Montevideo,France,4,1,Mexico,,4444.0,3,0,LOMBARDI Domingo (URU),CRISTOPHE Henry (BEL),REGO Gilberto (BRA),201,1096,FRA,MEX
1,1930,13 Jul 1930 - 15:00,Group 4,Parque Central,Montevideo,USA,3,0,Belgium,,18346.0,2,0,MACIAS Jose (ARG),MATEUCCI Francisco (URU),WARNKEN Alberto (CHI),201,1090,USA,BEL
2,1930,14 Jul 1930 - 12:45,Group 2,Parque Central,Montevideo,Yugoslavia,2,1,Brazil,,24059.0,2,0,TEJADA Anibal (URU),VALLARINO Ricardo (URU),BALWAY Thomas (FRA),201,1093,YUG,BRA
3,1930,14 Jul 1930 - 14:50,Group 3,Pocitos,Montevideo,Romania,3,1,Peru,,2549.0,1,0,WARNKEN Alberto (CHI),LANGENUS Jean (BEL),MATEUCCI Francisco (URU),201,1098,ROU,PER
4,1930,15 Jul 1930 - 16:00,Group 1,Parque Central,Montevideo,Argentina,1,0,France,,23409.0,0,0,REGO Gilberto (BRA),SAUCEDO Ulises (BOL),RADULESCU Constantin (ROU),201,1085,ARG,FRA
5,1930,16 Jul 1930 - 14:45,Group 1,Parque Central,Montevideo,Chile,3,0,Mexico,,9249.0,1,0,CRISTOPHE Henry (BEL),APHESTEGUY Martin (URU),LANGENUS Jean (BEL),201,1095,CHI,MEX
6,1930,17 Jul 1930 - 12:45,Group 2,Parque Central,Montevideo,Yugoslavia,4,0,Bolivia,,18306.0,0,0,MATEUCCI Francisco (URU),LOMBARDI Domingo (URU),WARNKEN Alberto (CHI),201,1092,YUG,BOL
7,1930,17 Jul 1930 - 14:45,Group 4,Parque Central,Montevideo,USA,3,0,Paraguay,,18306.0,2,0,MACIAS Jose (ARG),APHESTEGUY Martin (URU),TEJADA Anibal (URU),201,1097,USA,PAR
8,1930,18 Jul 1930 - 14:30,Group 3,Estadio Centenario,Montevideo,Uruguay,1,0,Peru,,57735.0,0,0,LANGENUS Jean (BEL),BALWAY Thomas (FRA),CRISTOPHE Henry (BEL),201,1099,URU,PER
9,1930,19 Jul 1930 - 12:50,Group 1,Estadio Centenario,Montevideo,Chile,1,0,France,,2000.0,0,0,TEJADA Anibal (URU),LOMBARDI Domingo (URU),REGO Gilberto (BRA),201,1094,CHI,FRA
10,1930,19 Jul 1930 - 15:00,Group 1,Estadio Centenario,Montevideo,Argentina,6,3,Mexico,,42100.0,3,1,SAUCEDO Ulises (BOL),ALONSO Gualberto (URU),RADULESCU Constantin (ROU),201,1086,ARG,MEX
11,1930,20 Jul 1930 - 13:00,Group 2,Estadio Centenario,Montevideo,Brazil,4,0,Bolivia,,25466.0,1,0,BALWAY Thomas (FRA),MATEUCCI Francisco (URU),VALLEJO Gaspar (MEX),201,1091,BRA,BOL
12,1930,20 Jul 1930 - 15:00,Group 4,Estadio Centenario,Montevideo,Paraguay,1,0,Belgium,,12000.0,1,0,VALLARINO Ricardo (URU),MACIAS Jose (ARG),LOMBARDI Domingo (URU),201,1089,PAR,BEL
13,1930,21 Jul 1930 - 14:50,Group 3,Estadio Centenario,Montevideo,Uruguay,4,0,Romania,,70022.0,4,0,REGO Gilberto (BRA),WARNKEN Alberto (CHI),SAUCEDO Ulises (BOL),201,1100,URU,ROU
14,1930,22 Jul 1930 - 14:45,Group 1,Estadio Centenario,Montevideo,Argentina,3,1,Chile,,41459.0,2,1,LANGENUS Jean (BEL),CRISTOPHE Henry (BEL),SAUCEDO Ulises (BOL),201,1084,ARG,CHI
15,1930,26 Jul 1930 - 14:45,Semi-finals,Estadio Centenario,Montevideo,Argentina,6,1,USA,,72886.0,1,0,LANGENUS Jean (BEL),VALLEJO Gaspar (MEX),WARNKEN Alberto (CHI),202,1088,ARG,USA
16,1930,27 Jul 1930 - 14:45,Semi-finals,Estadio Centenario,Montevideo,Uruguay,6,1,Yugoslavia,,79867.0,3,1,REGO Gilberto (BRA),SAUCEDO Ulises (BOL),BALWAY Thomas (FRA),202,1101,URU,YUG
17,1930,30 Jul 1930 - 14:15,Final,Estadio Centenario,Montevideo,Uruguay,4,2,Argentina,,68346.0,1,2,LANGENUS Jean (BEL),SAUCEDO Ulises (BOL),CRISTOPHE Henry (BEL),405,1087,URU,ARG

2. b If you haven't already, investigate why this code returns zero:

```python
print(len(df[df.City=="Montevideo"]))
```

In [103]:
#Your code here.

3. How many matches did USA play in 2014?  

Hint: they could have been home or away.  

You can combine conditions like this:  
```python
# Returns rows where either condition is true
df[(condition1) | (condition2)]

# Returns rows where both conditions are true  
df[(condition1) & (condition2)]
```

In [ ]:
#Your code here.

4. How many teams played in 1986?

In [ ]:
#Your code here.

5. How many matches were there with 5 or more total goals?

In [ ]:
#Your code here.

6. Come up with and answer, two other questions you could answer by filtering or subsetting this DataFrame.

In [ ]:
#6a Question:

In [ ]:
#6a Solution (with code):

In [ ]:
#6b Question:

In [ ]:
#6b Solution (with code):